   
    
   
- Git Extensions 설정 방법[2021.12.08(수)] @@@
01. 저장소 생성(웹(https://github.com)에서)
https://github.com/JINTAEMAN/01_Git_TAMA   ----> INTAEMAN/22tadhtlqenf!
2) HTTPS: https://github.com/JINTAEMAN/01_Git_TAMA.git
----------------------------------------------------------------------------------------------------

02. 저장소 Clone(Clone repository)  @@@
1. 로컬 탐색기에서 D:\91_Git_TAMA 폴더: 마우스 우 클릭 ==> GitExt Clone
2. Clone(새창)
 1) Repositories to clone: https://github.com/JINTAEMAN/01_Git_TAMA.git
 2) Destination: D:\91_Git_TAMA
 3) Subdirectory to create:  01_TEST
 4) Branch:  (default: remote HEAD) 
 5) repository type: Personal repository --> Clone: 클릭
==> .git 생성됨(D:\91_Git_TAMA\01_TEST)	 ===> ■■■
3. D:\91_Git_TAMA\01_TEST 폴더: 마우스 우 클릭 ==> GitExt Open repository
 
03. 저장소 수정 테스트 @@@
1. D:\91_Git_TAMA\01_TEST 폴더에서 01. Git Extensions 설정 방법.sql 파일 생성
2. Git Extensions 화면에서 Tab(Commit(1))로 표시됨  ==> Commit(1)): 클릭
3. Commit 화면(새창)
 1)  01. Git Extensions 설정 방법.sql 파일 ==> Stage 버튼 클릭
 2) Comment messsage: [DEV] [SI-메뉴얼게시판] [공통] [진태만] AS 게시판 관련 수정
 3) Commit: 클릭
 4) Process(새창) 
  Done   ==> OK: 클릭
4. ▶ main [DEV] [SI-메뉴얼게시판] [공통] [진태만] Git Extensions 설정 방법  ===> 표시됨 ■■■ 
----------------------------------------------------------------------------------------------------

5. Git Extensions 화면에서 Tab(▲) : 클릭
 1) Push(새창) 
   가. Remote: origin
   나. Branch to push: main to amin    ==> Push: 클릭
   다. Process(새창) 
    Done  ==> OK: 클릭 
 2) Push 확인
   가. https://github.com/JINTAEMAN/01_Git_TAMA==> JINTAEMAN/01_Git_TAMA  
JINTAEMAN 			[DEV] [SI-메뉴얼게시판] [공통] [진태만] Git Extensions 설정 방법 	f0f04ba		1 minute ago	  4 commits    ===> 표시됨 ■■■
01. Git Extensions 설정 방법.sql	[DEV] [SI-메뉴얼게시판] [공통] [진태만] Git Extensions 설정 방법_02	2 minutes ago 
==================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

'

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+-----------------------------------------// Git 정보 //-----------------------------------------------/ 2021.11.30(화) /---+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 
- #1 Git 설치 (Git & Git extensions) _ Git 환경에서 S/W 개발하기 첫번째 git 환경 구축[개발자를 꿈꾸다]
https://www.youtube.com/watch?v=ESePPSQSh24&list=PLk3PkBqRCyIEzFyMMrbxPo02JcfvVVtU5
 -----------------------------------------------------------------------------------------------------
 
1. Git Extensions 다운로드 및 설치(추천)
 1) GitExtensions224SetupComplete.msi  ==> https://sourceforge.net/projects/gitextensions
-----------------------------------------------------------------------------------------------------

2. Git Extensions 다운로드 및 설치  
 1) GitExtensions-3.4.3.9999-d4b0f48bb.msi ==> https://imdct.tistory.com/entry/Git-Extensions-%EC%84%A4%EC%B9%98
 2) Merge Tool  다운로드 및 설치
  가. Win Merge ==> https://winmerge.org/downloads/?lang=en
==============================================================================================================

- Cmder [Windows 콘솔 에뮬레이터] 설치 방법 + 한글사용방법
https://m.blog.naver.com/PostView.naver?isHttpsRedirect=true&blogId=altmshfkgudtjr&logNo=221461221105
==============================================================================================================

- 깃, 깃허브 제대로 배우기 (기본 마스터편, 실무에서 꿀리지 말자)  [드림코딩 by 엘리]
https://youtu.be/Z9dvM7qgN9s
==============================================================================================================

- Git에 들어가기 앞서
https://blog.huny.dev/git/
============================================================================================================== 

- [GitHub 깃허브] Repository 레파지토리 삭제 방법
출처: https://afsdzvcx123.tistory.com/entry/GitHub-깃허브-Repository-레파지토리-삭제-방법 [BeomBeomJoJo - Programmer]
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------------// End //------------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+-----------------------------------------// Git 정보2 //-----------------------------------------------/ 2021.11.30(화) /---+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- Git 정보 @@@
> mkdir git
> cd git
> git init     ---> git 초기화
> git -al 
 ==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------------// End //------------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
\

